Revit 2027 API
PanelScheduleData.SetBorderAroundSchedule Method
 Adds a border around the schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBorderAroundSchedule(
	ElementId borderId
)
Public Sub SetBorderAroundSchedule (
	borderId As ElementId
)
public:
void SetBorderAroundSchedule(
	ElementId^ borderId
)
member SetBorderAroundSchedule :
        borderId : ElementId -> unit
Parameters
borderId ElementId
 The border to set around the schedule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace